{
    "home": "Home",
    "login": "Log in",
    "signup": "Sign up",
    "website_mission_section1": "Our mission is simple: To help all computer enthusiasts of all different levels to improve their theoretical and practical foundations. By practicing solving realistic exercises on the AlgoPlus website, you will practice your logical reasoning, your knowledge of algorithms and data structure, while trying to produce the most optimal code possible. All in the programming language of your choice!",
    "website_mission_section2": "Our website also allows users to share articles, exercises and videos with other users for free, or by requesting a contribution. Make yourself known and work to grow your network of contacts in the industry by actively participating in the different sections of the site. Engaged users will be rewarded with leaderboard points.",
    "website_mission_section3": "Customize your profile, add a resume, and share exercises you've solved to attract employer interest. Let your adventure begin!",
    "articles": "Articles",
    "events": "Events",
    "contact": "Contact us",
    "dashboard": "Dashboard",
    "username": "Username",
    "password": "Password",
    "rememberme": "Remember-me",
    "logout": "Log out",
    "submit": "Submit",
    "errorlogin": "Login error. Check that you typed the username or the password correctly.",
    "confirmpassword": "Confirm your password",
    "email": "Email",
    "errorSignUp": "There was an error in the signup process.",
    "erroremailformat": "Wrong email format.",
    "errorusernametaken": "This username is already taken.",
    "erroremailtaken": "This email is already taken",
    "errorerrorformat": "The username should be between 3 and 20 characters and the password should be between 6 and 40 characters.",
    "errorpassworddontmatch": "The password validation step has failed. Make sure both passwords are the same",
    "emptyusername": "Please enter a username",
    "emptyemail": "Please enter a email",
    "emptypassword": "Please enter a password",
    "emptyconfirmpassword": "Please confirm your password",
    "pendingconfirmation": "A confirmation email has just been sent to you. Please click on the link inside to confirm your email. The link will stop being valid in 15 minutes. If you don't see the email in your inbox, check your SPAM folder.",
    "emailconfirmed": "Thank you for validating your email. You are now free to use and contribute to AlgoPlus. Please read the website rules before starting your adventure. Good luck!",
    "invalidtoken": "This link is invalid or has expired. Please try to register again to receive another confirmation email.",
    "forgotpassword": "Forgot your password?",
    "errorpendingconfirmation": "This account email hasn't been verified. Please click on the link you received in your inbox or folder to confirm your account or register again if it has expired.",
    "errorpasswordrequest": "There was an error in the process of the password request. Please try again",
    "nonexistantemail": "There is no account on this website linked to this email",
    "emailformaterror": "Please enter a valid email",
    "passwordrequestsuccess": "A email containing a confirmation link has been sent to you to reset your password. The link will be invalid in 15 minutes. Please check your SPAM folder if you don't see the email in your mailbox. ",
    "expiredlinkpassword": "This link has expired. Please ask again for a password reinitialization if you need to.",
    "changesuccess": "Your password has been succesfully updated. You will be redirected to the login page soon..",
    "errorchange": "There was an error in the process of the password change. Please try again",
    "errorpasswordformat": "The password should be between 6 and 40 characters.",
    "updateprofile": "Update your profile.",
    "updateavatar": "Update your avatar",
    "updatecv": "Update your CV",
    "uploadavatar": "Upload a new avatar",
    "uploadcv": "Upload a new CV",
    "uploadfailure": "Could not load the file",
    "articlebylanguages": "Articles by languages",
    "writearticle": "Write an article",
    "otherlanguages": "Other languages",
    "title": "Title",
    "contentofarticle": "Write your article",
    "sendarticle": "Publish your article",
    "imagearticle": "Upload an article image",
    "languagechoice": "Choose the programming language that your article is about",
    "author": "Author:",
    "published": "Published:",
    "errortitle": "You need to choose a title",
    "errorcontent": "You need to provide an article of at least 100 characters",
    "errorlanguage": "You need to chose a language category for your article",
    "errorimage": "You need to provide an image for your article",
    "errorgeneral": "There was an error in the process of publishing your article. Please try again.",
    "comments": "Comments:",
    "addcomment": "Write a commment to the article (You need to be logged in)",
    "comment": "Comment:",
    "errorcommentlength": "You need to write a comment of at least 10 characters",
    "yourarticles": "Your articles",
    "updatearticle": "Update this article",
    "deletearticle": "Delete this article",
    "keepsameimage": "Keep the same image for the article",
    "lastedited": "Last edition",
    "deletearticleconfirmation": "Are you sure you want to delete this article? This action is irreversible.",
    "deletecomment": "Delete your comment",
    "deletecommentconfirmation": "Are you sure you want to delete this comment? This action is irreversible.",
    "language": "Language",
    "exercise": "Coding exercises",
    "run": "Run",
    "clear": "Clear",
    "beautify": "Beautify",
    "output": "Output",
    "exerciseexplanation": "Consider that your program will be run as if it were executed at the command line. You must therefore include all imports, class notations and method notations if necessary. In addition, the parameters to be used for your program and which will be used for the tests will be passed as a string by stdin (standard input stream) For example, a call to the printmessage.java program to print Hello World would be done as follows: \"Hello World\" | java printmessage . Finally, your program has to print your solution to the stdout.",
    "exercisecreationerror": "There was an error in the process of creating the exercise. Please try again.",
    "errorexplanation": "You need to provide an explanation for your exercise.",
    "errorsolutions": "You need to provide 4 sets of (input, expected output) for your exercise (used for testing)",
    "explanation": "Provide an explanation for your exercise",
    "solutions": "Provide 4 sets of (input, expect output) for your exercise",
    "exerciseimage": "Provide an image for your exercise(optional)",
    "explanationtitle": "This section allows you to:",
    "createexplanation1": "Create programming challenge to share with others",
    "createexplantion2": "Personalize your exercise by adding image, explanation and provide test solutions ",
    "createexplanation3": "Earn the maximum of points you can by participating in the growth of the community!",
    "resolveexplanation1": "Work on your programming skills by resolving challenge created by others users of the community",
    "resolveexplanation2": "Develop your knowledge of a multitude of programming langage by trying to resolve challenge in Java, C, C++, Python, PHP, NodeJs and SQL",
    "resolveexplanation3": "Make yourself known by earning some points when resolving correctly the challenges and climb up the ranking!",
    "startresolving": "Start resolving challenge now!",
    "startcreating": "Start creating challenge now!",
    "input": "Input(need to be a string(without surrounding quotes), if you want to pass an array, pass the value like this : 1 2 3 ... 6 7 8 ",
    "outputsolution": "Expected output(need to be a string(without surrounding quotes), if you expect the solution to be an array, pass the value like this : 1 2 3 ... 6 7 8",
    "solutionsetsexplanation": "For example: If your program ask to calculate the sum of an array containing integers, your first test could be \"input = 1 2 4 6 9, output = 22\" ",
    "forminput": "Input",
    "formoutput": "Output",
    "resolve": "Start this challenge",
    "errortitleevent": "Please provide a title for the event",
    "errorfieldevent": "Invalid event. All field need to be filled.",
    "programmingcalender": "Calendar of programming event",
    "addevent": "Add an event",
    "startdate": "Start date",
    "starttime": "Start time",
    "enddate": "End date",
    "endtime": "End time",
    "allday": "All day event",
    "notloggedinevent": "You need to be logged in to add an event to the calender",
    "deleteevent": "Delete this event?",
    "errordatevalidity": "End time should be after start time",
    "rules": "Rules",
    "rulesdescription": "At AlgoPlus, we seek to promote a climate of respect between Internet users. For this reason, there are certain important rules to respect if the Internet user wants to keep his rights to participate in the community.",
    "rulesp1": "Each user starts with 10 safety points. Each violation causes a loss of points, depending on the severity. If the user loses all his points, he will be deprived of participation rights for an indefinite period. This even Internate will eventually get another chance with 10 new points at the end of his temporary suspension, but if he were to lose all those points a second time, it would result in a permanent account closure. A serious offense can justifies the permanent closure of the account, regardless of the number of points that the person concerned has.",
    "rulestitle": "List of Rules and Violation Penalty:",
    "rulekey1": "Comment deemed irrelevant",
    "rulevalue1": "Removed comment.",
    "rulekey2": "Comment considered disrespectful",
    "rulevalue2": "- 2 points.",
    "rulekey3": "Article deemed irrelevant",
    "rulevalue3": "Item removed and -3 points",
    "rulekey4": "Article deemed not respectful",
    "rulevalue4": "-5 points",
    "rulekey5": "Invalid exercise creation (faulty test, explanation not complete enough)",
    "rulevalue5": "-2 points",
    "rulekey6": "Cheating on exercises",
    "rulevalue6": "- 5 points",
    "conclusions": "You agree to these terms when participating in the website. No bargaining will be permitted.",
    "thankyou": "Thank you"

}