{
    "home": "Home",
    "login": "Log in",
    "signup": "Sign up",
    "website_mission_section1": "Our mission is simple: To help all computer enthusiasts of all different levels to improve their theoretical and practical foundations. By practicing solving realistic exercises on the AlgoPlus website, you will practice your logical reasoning, your knowledge of algorithms and data structure, while trying to produce the most optimal code possible. All in the programming language of your choice!",
    "website_mission_section2": "Our website also allows users to share articles, exercises and videos with other users for free, or by requesting a contribution. Make yourself known and work to grow your network of contacts in the industry by actively participating in the different sections of the site. Engaged users will be rewarded with leaderboard points.",
    "website_mission_section3": "Customize your profile, add a resume, and share exercises you've solved to attract employer interest. Let your adventure begin!",
    "articles": "Articles",
    "events": "Events",
    "contact": "Contact us",
    "dashboard": "Dashboard",
    "username": "Username",
    "password": "Password",
    "rememberme": "Remember-me",
    "logout": "Log out",
    "submit": "Submit",
    "errorlogin": "Login error. Check that you typed the username or the password correctly.",
    "confirmpassword": "Confirm your password",
    "email": "Email",
    "errorSignUp": "There was an error in the signup process.",
    "erroremailformat": "Wrong email format.",
    "errorusernametaken": "This username is already taken.",
    "erroremailtaken": "This email is already taken",
    "errorerrorformat": "The username should be between 3 and 20 characters and the password should be between 6 and 40 characters.",
    "errorpassworddontmatch": "The password validation step has failed. Make sure both passwords are the same",
    "emptyusername": "Please enter a username",
    "emptyemail": "Please enter a email",
    "emptypassword": "Please enter a password",
    "emptyconfirmpassword": "Please confirm your password",
    "pendingconfirmation": "A confirmation email has just been sent to you. Please click on the link inside to confirm your email. The link will stop being valid in 15 minutes. If you don't see the email in your inbox, check your SPAM folder.",
    "emailconfirmed": "Thank you for validating your email. You are now free to use and contribute to AlgoPlus. Please read the website rules before starting your adventure. Good luck!",
    "invalidtoken": "This link is invalid or has expired. Please try to register again to receive another confirmation email.",
    "forgotpassword": "Forgot your password?",
    "errorpendingconfirmation": "This account email hasn't been verified. Please click on the link you received in your inbox or folder to confirm your account or register again if it has expired.",
    "errorpasswordrequest": "There was an error in the process of the password request. Please try again",
    "nonexistantemail": "There is no account on this website linked to this email",
    "emailformaterror": "Please enter a valid email",
    "passwordrequestsuccess": "A email containing a confirmation link has been sent to you to reset your password. The link will be invalid in 15 minutes. Please check your SPAM folder if you don't see the email in your mailbox. ",
    "expiredlinkpassword": "This link has expired. Please ask again for a password reinitialization if you need to.",
    "changesuccess": "Your password has been succesfully updated. You will be redirected to the login page soon..",
    "errorchange": "There was an error in the process of the password change. Please try again",
    "errorpasswordformat": "The password should be between 6 and 40 characters.",
    "updateprofile": "Update your profile.",
    "updateavatar": "Update your avatar",
    "updatecv": "Update your CV",
    "uploadavatar": "Upload a new avatar",
    "uploadcv": "Upload a new CV",
    "uploadfailure": "Could not load the file",
    "articlebylanguages": "Articles by languages",
    "writearticle": "Write an article",
    "otherlanguages": "Other languages",
    "title": "Title",
    "contentofarticle": "Write your article",
    "sendarticle": "Publish your article",
    "imagearticle": "Upload an article image",
    "languagechoice": "Choose the programming language that your article is about"
}