{
    "home": "Accueil",
    "login": "Connexion",
    "signup": "Créer un compte",
    "website_mission_section1": "Notre mission est simple: Aider tous les enthousiastes d'informatiques de tous les différents niveaux à améliorer leurs fondations théoriques et pratiques. En s'exerçant à résoudre des exercises réalistes sur le site web AlgoPlus, vous pratiquerez votre raisonnement logique, vos connaissances d'algorithmes et de structure de données, tout en tentant de produire du code le plus optimal possible. Le tout dans le language de programmation de votre choix!",
    "website_mission_section2": "Notre site web permet aussi aux utilisateurs de partager des articles, des exercices et des vidéos avec les autres utilisateurs de façon gratuite, ou en demandant une contribution. Faites-vous connaître et travailler à grandir votre réseau de contacts dans le milieu en participant de façon active dans les différentes sections du site. Les utilisateurs engagés seront recompensés par des points au classement.",
    "website_mission_section3": "Personnalisez votre profil, ajouter un CV et partager les exercices que vous avez résolus pour attirer l'intérêt des employeurs. Que votre aventure commence!",
    "articles": "Articles",
    "events": "Événements",
    "contact": "Nous rejoindre",
    "dashboard": "Tableau de bord",
    "username": "Nom d'utilisateur",
    "password": "Mot de passe",
    "rememberme": "Se souvenir de moi",
    "logout": "Se déconnecter",
    "errorlogin": "Erreur de connection. Vérifiez que vous avez entrez correctement le nom d'utilisateur et le mot de passe.",
    "confirmpassword": "Confirmez votre mot de passe",
    "email": "Adresse de courriel électronique",
    "errorSignUp": "Il y a eu une erreur dans le processur de connexion.",
    "erroremailformat": "Mauvais format de courriel électronique.",
    "errorusernametaken": "Ce nom d'utilisateur est déjà utilisé.",
    "erroremailtaken": "Cette adresse de courriel électronique est déjà prise.",
    "errorerrorformat": "Le nom d'utilisateur devrait être en 3 et 20 caractères et le mot de passes devrait être en 6 et 40 caractères.",
    "errorpassworddontmatch": "The password confirmation has failed. Make sure both passwords are the same",
    "emptyusername": "Veuillez s'il vous plaît entrez un nom d'utilisateur",
    "emptyemail": "Veuillez s'il vous plaît entrez une adresse de courriel électronique",
    "emptypassword": "Veuillez s'il vous plaît entrez un mot de passe",
    "emptyconfirmpassword": "Veuillez s'il vous plaît confirmer votre mot de passe"
}