{
    "home": "Accueil",
    "login": "Connexion",
    "signup": "Créer un compte",
    "website_mission_section1": "Notre mission est simple: Aider tous les enthousiastes d'informatiques de tous les différents niveaux à améliorer leurs fondations théoriques et pratiques. En s'exerçant à résoudre des exercises réalistes sur le site web AlgoPlus, vous pratiquerez votre raisonnement logique, vos connaissances d'algorithmes et de structure de données, tout en tentant de produire du code le plus optimal possible. Le tout dans le language de programmation de votre choix!",
    "website_mission_section2": "Notre site web permet aussi aux utilisateurs de partager des articles, des exercices et des vidéos avec les autres utilisateurs de façon gratuite, ou en demandant une contribution. Faites-vous connaître et travailler à grandir votre réseau de contacts dans le milieu en participant de façon active dans les différentes sections du site. Les utilisateurs engagés seront recompensés par des points au classement.",
    "website_mission_section3": "Personnalisez votre profil, ajoutez un CV et partager les exercices que vous avez résolus pour attirer l'intérêt des employeurs. Que votre aventure commence!",
    "articles": "Articles",
    "events": "Événements",
    "contact": "Nous rejoindre",
    "dashboard": "Tableau de bord",
    "username": "Nom d'utilisateur",
    "password": "Mot de passe",
    "rememberme": "Se souvenir de moi",
    "logout": "Se déconnecter",
    "submit": "Soumettre",
    "errorlogin": "Erreur de connection. Vérifiez que vous avez entrez correctement le nom d'utilisateur et le mot de passe.",
    "confirmpassword": "Confirmez votre mot de passe",
    "email": "Adresse de courriel électronique",
    "errorSignUp": "Il y a eu une erreur dans le processur de connexion.",
    "erroremailformat": "Mauvais format de courriel électronique.",
    "errorusernametaken": "Ce nom d'utilisateur est déjà utilisé.",
    "erroremailtaken": "Cette adresse de courriel électronique est déjà prise.",
    "errorerrorformat": "Le nom d'utilisateur devrait être en 3 et 20 caractères et le mot de passes devrait être en 6 et 40 caractères.",
    "errorpassworddontmatch": "La confirmation de mot de passe a échouée. Assurez-vous que les mots de passes sont compatibles",
    "emptyusername": "Veuillez s'il vous plaît entrez un nom d'utilisateur",
    "emptyemail": "Veuillez s'il vous plaît entrez une adresse de courriel électronique",
    "emptypassword": "Veuillez s'il vous plaît entrez un mot de passe",
    "emptyconfirmpassword": "Veuillez s'il vous plaît confirmer votre mot de passe",
    "pendingconfirmation": "Un email de confirmation vient de vous être envoyez. Veuillez s'il vous plaît confirmer votre courriel en cliquant sur le lien à l'intérieur du courriel. Le lien n'est valide que pour les 15 prochaines minutes. Si vous ne voyez pas le courriel dans votre boîte de réception, vérifiez vos courriels indésirables.",
    "emailconfirmed": "Merci d'avoir valider votre courriel électronique. Vous êtes maintenant libre d'utiliser et de contribuer à AlgoPlus.  Veuillez s'il vous plaît lire les règles du site web avant de commencer votre aventure. Bonne chance!",
    "invalidtoken": "Ce lien est invalide. Veuillez s'il vous plaît vous enregistez à nouveau pour recevoir un autre email de confirmation.",
    "forgotpassword": "Vous avez oublié votre mot de passe?",
    "errorpendingconfirmation": "L'adresse de courriel électronique de ce compte n'a pas encore été activée. Veuillez s'il vous plaît cliquez sur le lien reçu dans votre boîte de courriel ou dans vos courriels indésirables, ou bien crée un compte à nouveau si celui-ci a expérié.",
    "errorpasswordrequest": "Il y a eu une erreur dans le processus de demande de récupération de mot de passe. Veuillez s'il vous plaît réessayez à nouveau. ",
    "nonexistantemail": "Il n'y a pas de compte sur ce site web rattaché à cette adresse de courriel électronique",
    "emailformaterror": "Veuillez s'il vous plaît entrez une adresse de courriel valide",
    "passwordrequestsuccess": "Un courriel électronique vous a été envoyez contenant un lien pour réinitialiser votre mot de passe. Le lien sera échoué dans 15 minutes.Si vous ne voyez pas le courriel dans votre boîte de réception, vérifiez vos courriels indésirables. ",
    "expiredlinkpassword": "Ce lien est expiré. Veuillez s'il vous plaît refaire la demande pour une réinitialisation de mot de passe au besoin.",
    "errorpasswordformat": "Le mot de passe devrait être entre 6 et 40 caractères.",
    "updateprofile": "Modifier votre profil.",
    "uploadavatar": "Modifier votre image de profil",
    "uploadcv": "Modifier votre CV",
    "uploadfailure": "Échec de téléchargement du fichier!",
    "articlebylanguages": "Articles par languages",
    "writearticle": "Écrire un article",
    "otherlanguages": "Autre langages",
    "title": "Titre",
    "contentofarticle": "Rédigez votre article",
    "sendarticle": "Publiez votre article",
    "imagearticle": "Télécharger une image pour votre article",
    "languagechoice": "Choisissez le langage de programmation qui est abordé dans votre article",
    "author": "Auteur:",
    "published": "Publié le:",
    "errortitle": "Vous devez fournir un titre",
    "errorcontent": "Vous devez composer un article d'au moins 100 caractères.",
    "errorlanguage": "Vous devez choisir un langage de programmation pour votre article",
    "errorimage": "Vous devez fournir une image pour votre article",
    "errorgeneral": "Une erreur est survenue lors de la publication de votre article. S'il vous plaît, veuillez réessayer plus tard.",
    "comments": "Commentaires:",
    "addcomment": "Ajoutez un commentaire sur l'article (Vous devez être connecté pour écrire un commentaire) ",
    "comment": "Commentaire:",
    "errorcommentlength": " Vous devez écrire un commentaire d'au moins 10 caractères",
    "yourarticles": "Vos articles:",
    "updatearticle": "Modifier cet article",
    "deletearticle": "Supprimer cet article",
    "keepsameimage": "Préserver la même image pour l'article",
    "lastedited": "Dernière mise à jour",
    "deletearticleconfirmation": "Êtes-vous sûr de vouloir supprimer cet article? Cette action est irréversible.",
    "deletecomment": "Supprimer votre commentaire",
    "deletecommentconfirmation": "Êtes-vous sûr de vouloir supprimer ce commentaire? Cette action est irréversible.",
    "language": "Langage",
    "exercise": "Exercises de programmation",
    "run": "Exécuter",
    "clear": "Nettoyer",
    "beautify": "Indenter",
    "output": "Sortie",
    "exerciseexplanation": "Considérez que votre programme sera roulé comme si il était exécuter à la ligne de commande. Vous devez donc inclure tout les imports, les notations de classe et les notations de méthodes si nécéssaires. De plus, les paramètres à utiliser pour votre programme et qui seront utilisés pour les tests seront passés comme un string par stdin(flux standard d'entrée). Par exemple, un appel au programme printmessage.java pour imprimer Hello World se ferait de la façon suivante: \"Hello World\" | java printmessage . Finalement, votre programme doit imprimer la solution par le stdout(flux standard de sortie) ",
    "exercisecreationerror": "Il y a eu une erreur dans la création de l'exercise. S'Il vous plaît, veuillez réessayer.",
    "errorexplanation": "Vous devez fournir une explication pour votre exercise",
    "errorsolutions": "Vous devez fournir 4 entrées de (entrée, sortie attendue) pour votre exercise (utilisé pour les tests)",
    "explanation": "Fournissez une explication pour votre exercice",
    "solutions": "Fournissez 4 pairs de (entrée, sortie attendue) pour votre exercise",
    "exerciseimage": "Fournissez une image pour votre exercise(optionnel)",
    "explanationtitle": "Cette section vous permet de:",
    "createexplanation1": "Créer un défi de programmation à partager avec les autres",
    "createexplantion2": "Personnalisez votre exercice en ajoutant une image, une explication et fournissez des solutions de test",
    "createexplanation3": "Gagnez le maximum de points que vous pouvez en participant à la croissance de la communauté !",
    "resolveexplanation1": "Travaillez vos compétences en programmation en résolvant les défis créés par d'autres utilisateurs de la communauté",
    "resolveexplanation2": "Développez vos connaissances d'une multitude de langages de programmation en essayant de résoudre des défis en Java, C, C++, Python, PHP, NodeJs et SQL",
    "resolveexplanation3": "Faites-vous connaître en gagnant des points en résolvant correctement les défis et grimpez dans le classement !",
    "startresolving": "Commencer à résoudre des défis dès maintenant!",
    "startcreating": "Commencer à créé des défis dès maintenant!",
    "input": "Entrée(doit être un string(sans guillet aux extrémitées), si vous voulez passez un tableau, passer les valeurs de la façon suivante: 1 2 3 ... 6 7 8 ",
    "outputsolution": "Sortie(doit être un string(sans guillet aux extrémitées), si la solution doit retourner un tableau, passer les valeurs de la façon suivante: 1 2 3 ... 6 7 8",
    "solutionsetsexplanation": "Par exemple: Si votre programme demande de faire la somme d'un tableau d'integers, votre premier test pourrait être \"entrée = 1 2 4 6 9, sortie = 22\" ",
    "forminput": "Entrée",
    "formoutput": "Sortie",
    "resolve": "Commencer ce défis",
    "errortitleevent": "Veuillez indiquez le nom de l'événement.",
    "errorefieldevent": "Veuillez remplir tous les champs.",
    "programmingcalender": "Calendrier des événements d'informatiques",
    "addevent": "Ajouter un événement",
    "startdate": "Date de début",
    "starttime": "Heure de début",
    "enddate": "Date de fin",
    "endtime": "Heure de fin",
    "allday": "Événement dure toute la journée"
}